{
    "backend": "tensorflow",
    "class_name": "Sequential",
    "config": {
        "layers": [
            {
                "class_name": "Dense",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "batch_input_shape": [
                        null,
                        276
                    ],
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_1",
                    "trainable": true,
                    "units": 276,
                    "use_bias": true
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_1",
                    "trainable": true
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_2",
                    "trainable": true,
                    "units": 184,
                    "use_bias": true
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_2",
                    "trainable": true
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_3",
                    "trainable": true,
                    "units": 92,
                    "use_bias": true
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_3",
                    "trainable": true
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_4",
                    "trainable": true,
                    "units": 92,
                    "use_bias": true
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_4",
                    "trainable": true
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_5",
                    "trainable": true,
                    "units": 92,
                    "use_bias": true
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_5",
                    "trainable": true
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_6",
                    "trainable": true,
                    "units": 92,
                    "use_bias": true
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_6",
                    "trainable": true
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_7",
                    "trainable": true,
                    "units": 92,
                    "use_bias": true
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_7",
                    "trainable": true
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_8",
                    "trainable": true,
                    "units": 92,
                    "use_bias": true
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_8",
                    "trainable": true
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_9",
                    "trainable": true,
                    "units": 92,
                    "use_bias": true
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_9",
                    "trainable": true
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_10",
                    "trainable": true,
                    "units": 184,
                    "use_bias": true
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_10",
                    "trainable": true
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_11",
                    "trainable": true,
                    "units": 276,
                    "use_bias": true
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_11",
                    "trainable": true
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_12",
                    "trainable": true,
                    "units": 276,
                    "use_bias": true
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_12",
                    "trainable": true
                }
            }
        ],
        "name": "sequential_1"
    },
    "keras_version": "2.2.4"
}
